trialWicking/singleYarn_vertical_hybrid/0/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

// permeability as in ../singleYarn_vertical_impes_inletRes
internalField   uniform 1e-11;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    "(right|yarn_to_fluid)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
