trialWicking/singleYarn_vertical_hybrid/0/Uwetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uwetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

// Boundary types matter: on a patch where Uwetting or UnonWetting is
// fixedValue, alphaEqn.H rebuilds the relative (counter-current) flux from
// the two boundary velocities, and correctUBc.H (Uwetting fixed, U not)
// overwrites the total flux with Uwetting + UnonWetting. Otherwise the
// relative flux on the patch is zero.
// Top: fixed 0, so only air leaves the yarn (as Ub fixed 0 in impesFoam).
// Reservoir face (left): zeroGradient, water enters with the total flux. Same
// as the outlet / inlet of ../1D_vertical_hybrid.
boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    // lateral surface closed to both phases (see 0/U)
    yarn_to_fluid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
