trialWicking/singleYarn_vertical_hybrid/0/alpha.wetting.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// uniform dry state; ./run copies this file to 0/alpha.wetting and setFields
// adds the prewetted ramp at the bottom (system/setFieldsDict)
internalField   uniform 0.002;

boundaryField
{
    // infinite water reservoir (as in the Capillary_Rise tutorial): whatever
    // enters through the yarn end face (left) is at alpha 0.99, the same
    // value as the impesFoam case (../singleYarn_vertical_impes_inletRes)
    left
    {
        type            inletOutlet;
        inletValue      uniform 0.99;
        value           uniform 0.99;
    }
    // zeroGradient, not fixed: a fixed alpha here (even equal to the column
    // value) lets the capillary flux draw water in through the face; in
    // ../1D_vertical_hybrid it piled up in the top cell and crashed the run
    "(right|yarn_to_fluid)"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
