trialWicking/singleYarn_vertical_hybrid/0/eps
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      eps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// porosity as in ../singleYarn_vertical_impes_inletRes; eps < 0.99
// everywhere, so the whole yarn is porous (Darcy model, Solid = 1)
internalField   uniform 0.5;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    "(right|yarn_to_fluid)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
