trialWicking/singleYarn_vertical_hybrid/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../caseSetup"
// Keep the snapped yarn cellZone from snappyHexMesh; fluid = everything else
actions
(
    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name yarn;
        }
    }
    {
        name    fluid;
        type    cellZoneSet;
        action  invert;
    }
);

// ************************************************************************* //
